alambe94/STM32_Bit_Bang/STM32_Bit_Bang_UART/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define UART_TX1_Pin GPIO_PIN_3
#define UART_TX1_GPIO_Port GPIOA
#define UART_TX2_Pin GPIO_PIN_4
#define UART_TX2_GPIO_Port GPIOA
#define UART_TX3_Pin GPIO_PIN_5
#define UART_TX3_GPIO_Port GPIOA
#define UART_TX4_Pin GPIO_PIN_6
#define UART_TX4_GPIO_Port GPIOA
#define UART_TX5_Pin GPIO_PIN_7
#define UART_TX5_GPIO_Port GPIOA
#define UART_TX6_Pin GPIO_PIN_0
#define UART_TX6_GPIO_Port GPIOB
#define UART_TX7_Pin GPIO_PIN_1
#define UART_TX7_GPIO_Port GPIOB
#define UART_TX8_Pin GPIO_PIN_2
#define UART_TX8_GPIO_Port GPIOB
#define UART_TX9_Pin GPIO_PIN_10
#define UART_TX9_GPIO_Port GPIOB
#define UART_TX10_Pin GPIO_PIN_11
#define UART_TX10_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
